[
  {
    "title": "Strawberry Cream Cheesecake",
    "full_description": "This Strawberry Cream Cheesecake is a delightful treat that combines a rich and creamy cheesecake with a crunchy graham cracker crust. The colorful swirl of purple, blue, and pink makes it visually stunning as well.",
    "photo": "/Images/menus/menu144.jpg",
    "ingredients": {
      "Crust": [
        "400g graham crackers",
        "150g unsalted butter, melted"
      ],
      "Cheesecake": [
        "300g marshmallows",
        "175g unsalted butter, melted",
        "500g Philadelphia cream cheese, softened",
        "250ml thickened/whipping cream, warm",
        "3 tbsp powdered gelatin + 3 tbsp water",
        "5 drops purple food gel",
        "3 drops blue food gel"
      ]
    },
    "instructions": [
      "To prepare crust, add graham crackers to a food processor and process until you reach fine crumbs. Add melted butter and pulse 3-4 times to coat crumbs with butter.",
      "Pour mixture into a 20cm (8\") tart tin. Use the back of a spoon to firmly press the mixture out across the bottom and sides of the tart tin. Chill for 30 min.",
      "Begin by adding the marshmallows and melted butter into a microwave safe bowl. Microwave for 30 seconds and mix to combine. Set aside.",
      "Add the gelatin and water to a small mixing bowl and mix to combine. Microwave for 30 seconds.",
      "Add the cream cheese to the marshmallow mixture and use a hand mixer or stand mixer fitted with a paddle attachment to mix until smooth.",
      "Add the warm cream and melted gelatin mixture and mix until well combined.",
      "Add 1/3 of the mixture to a mixing bowl, add purple food gel and mix until well combined. Colour 1/3 of the mixture blue. Split the remaining mixture into two mixing bowls, colour one pink and leave the other white.",
      "Pour half the purple cheesecake mixture into the chilled tart crust. Add half the blue and then add the remaining purple and blue in the tart tin. Use a spoon to drizzle some pink cheesecake on top. Use a skewer or the end of a spoon to swirl the pink. Add some small dots of the plain cheesecake mixture to create stars and then sprinkle some more stars on top before chilling for 2 hours.",
      "Slice with a knife to serve."
    ]
  },
  {
    "title": "Fancy Glazed Donuts",
    "full_description": "These donuts are soft, fluffy, and perfect for any occasion. Their glaze gives them the perfect sweetness and shine, making them irresistible.",
    "photo": "/Images/menus/glazed-donut-recipe-1-65008ab2b45fb.avif",
    "ingredients": {
      "Dough": [
        "500g all-purpose flour",
        "7g active dry yeast",
        "50g sugar",
        "2 eggs",
        "250ml warm milk",
        "75g unsalted butter, melted",
        "1/2 tsp salt"
      ],
      "Glaze": [
        "200g powdered sugar",
        "3 tbsp milk",
        "1 tsp vanilla extract"
      ]
    },
    "instructions": [
      "In a large bowl, combine flour, yeast, and sugar.",
      "Add eggs, warm milk, and melted butter. Mix until a dough forms.",
      "Knead the dough on a floured surface for 10 minutes.",
      "Place dough in a greased bowl, cover, and let it rise for 1 hour.",
      "Roll out dough and cut into donut shapes. Let rise for 30 more minutes.",
      "Heat oil in a deep pan and fry donuts until golden brown.",
      "Mix powdered sugar, milk, and vanilla to create the glaze.",
      "Dip the donuts in the glaze and let them set before serving."
    ]
  },
  {
    "title": "Spinach and Cheese Pasta",
    "full_description": "A simple and delicious pasta dish made with spinach and cheese for a perfect weeknight meal.",
    "photo": "/Images/menus/menu2.jpg",
    "ingredients": {
      "pasta": [
        "400g penne pasta",
        "2 tbsp olive oil",
        "3 cloves garlic, minced",
        "200g fresh spinach",
        "250g ricotta cheese",
        "100g grated Parmesan cheese",
        "Salt and black pepper to taste"
      ]
    },
    "instructions": [
      "Cook the pasta according to package instructions. Drain and set aside.",
      "In a large pan, heat olive oil and sauté garlic until fragrant.",
      "Add fresh spinach and cook until wilted.",
      "Stir in ricotta cheese and cooked pasta. Mix well.",
      "Add Parmesan cheese, salt, and black pepper. Toss to combine.",
      "Serve hot with an extra sprinkle of Parmesan cheese."
    ]
  },
  {
    "title": "Cranberry Macaroon Ice Cream Cake",
    "full_description": "This Cranberry Macaroon Ice Cream Cake features a crunchy macaroon base layered with smooth, creamy ice cream and topped with fresh cranberries, making it a perfect dessert for any occasion.",
    "photo": "/Images/menus/menu126.jpg",
    "ingredients": {
      "macaroon base": [
        "1 1/2 cups shredded coconut",
        "1/2 cup sugar",
        "2 egg whites",
        "1 tsp vanilla extract"
      ],
      "ice cream layer": [
        "2 cups vanilla ice cream",
        "1/2 cup cranberry sauce"
      ],
      "topping": [
        "1/2 cup fresh cranberries",
        "1 tbsp powdered sugar"
      ]
    },
    "instructions": [
      "Preheat your oven to 350°F (175°C).",
      "In a bowl, mix shredded coconut, sugar, egg whites, and vanilla extract. Stir until the mixture is well combined.",
      "Spread the coconut mixture into a greased 9-inch round pan and bake for 15-20 minutes, or until golden brown.",
      "Allow the macaroon base to cool completely.",
      "Once cooled, scoop the vanilla ice cream and spread it over the macaroon base.",
      "Top the ice cream layer with cranberry sauce and smooth it evenly.",
      "Decorate with fresh cranberries and dust with powdered sugar.",
      "Freeze the cake for at least 2 hours before serving."
    ]
  },
  {
    "title": "No Bake Cheesecake",
    "full_description": "This No Bake Cheesecake is a simple and delicious dessert with a creamy filling and a crunchy graham cracker crust. No oven needed, making it a perfect recipe for hot days.",
    "photo": "/Images/menus/menu127.jpg",
    "ingredients": {
      "crust": [
        "1 1/2 cups graham cracker crumbs",
        "1/4 cup melted butter",
        "1/4 cup sugar"
      ],
      "cheesecake filling": [
        "500g cream cheese, softened",
        "1 cup heavy cream",
        "1/2 cup powdered sugar",
        "1 tsp vanilla extract"
      ]
    },
    "instructions": [
      "In a bowl, combine the graham cracker crumbs, melted butter, and sugar. Press the mixture into the base of a 9-inch pie dish or springform pan to form the crust.",
      "Refrigerate the crust for 30 minutes to set.",
      "In a separate bowl, beat the softened cream cheese until smooth and creamy.",
      "Add the powdered sugar and vanilla extract, and beat again until smooth.",
      "In another bowl, whip the heavy cream until stiff peaks form.",
      "Gently fold the whipped cream into the cream cheese mixture until fully combined.",
      "Spread the cheesecake filling over the chilled crust, smoothing it out evenly.",
      "Chill the cheesecake in the fridge for at least 4 hours, or overnight, before serving."
    ]
  },
  {
    "title": "Double Thick Layered Sponge Cake",
    "full_description": "This Double Thick Layered Sponge Cake features two layers of fluffy, light sponge cake filled with thick, creamy frosting, perfect for any celebration.",
    "photo": "/Images/menus/menu124.jpg",
    "ingredients": {
      "sponge cake": [
        "4 large eggs",
        "1 cup all-purpose flour",
        "1 cup sugar",
        "1/4 cup melted butter"
      ],
      "filling": [
        "2 cups whipped cream",
        "1/4 cup powdered sugar"
      ]
    },
    "instructions": [
      "Preheat your oven to 350°F (175°C).",
      "In a bowl, beat the eggs and sugar together until fluffy and light.",
      "Sift in the flour and gently fold it into the egg mixture until well combined.",
      "Pour the batter into two greased 8-inch cake pans and bake for 20-25 minutes, or until a toothpick inserted into the center comes out clean.",
      "Allow the cakes to cool completely on a wire rack.",
      "In a separate bowl, whip the cream and powdered sugar together until stiff peaks form.",
      "Once the cakes are cool, slice them in half to create four layers.",
      "Spread a layer of whipped cream between each cake layer.",
      "Top the final layer with more whipped cream and decorate as desired."
    ]
  },
  {
    "title": "Caramel Glaze Cake",
    "full_description": "This Caramel Glaze Cake features a moist and flavorful cake topped with a smooth and rich caramel glaze, making it a perfect dessert for any occasion.",
    "photo": "/Images/menus/menu133.jpg",
    "ingredients": {
      "cake": [
        "1 1/2 cups all-purpose flour",
        "1 cup sugar",
        "1/2 cup butter",
        "2 eggs",
        "1 tsp vanilla extract",
        "1/2 cup milk"
      ],
      "caramel glaze": [
        "1/2 cup butter",
        "1 cup brown sugar",
        "1/4 cup heavy cream"
      ]
    },
    "instructions": [
      "Preheat your oven to 350°F (175°C).",
      "In a mixing bowl, cream together the butter and sugar.",
      "Add the eggs, one at a time, and beat until smooth. Stir in the vanilla extract.",
      "Gradually add the flour and milk, mixing until combined.",
      "Pour the batter into a greased 9-inch round cake pan and bake for 25-30 minutes, or until a toothpick comes out clean.",
      "While the cake is cooling, make the caramel glaze. In a saucepan, melt the butter over medium heat.",
      "Stir in the brown sugar and heavy cream, and bring to a simmer. Cook for 5-7 minutes until the glaze thickens.",
      "Pour the warm caramel glaze over the cooled cake and allow it to set before serving."
    ]
  },
  {
    "title": "Strawberry Cream Cake Bites",
    "full_description": "These Strawberry Cream Cake Bites are perfect for a light dessert or snack, made with soft cake, topped with fresh strawberries and whipped cream.",
    "photo": "/Images/menus/menu139.jpg",
    "ingredients": {
      "cake": [
        "1 cup all-purpose flour",
        "1/2 cup sugar",
        "1/2 cup milk",
        "1/4 cup butter",
        "2 eggs"
      ],
      "topping": [
        "1 cup fresh strawberries, sliced",
        "1/2 cup whipped cream"
      ]
    },
    "instructions": [
      "Preheat your oven to 350°F (175°C).",
      "In a mixing bowl, combine flour, sugar, milk, butter, and eggs. Stir until smooth.",
      "Pour the batter into a greased mini muffin tin and bake for 12-15 minutes, or until a toothpick inserted into the center comes out clean.",
      "Allow the mini cakes to cool completely.",
      "Top each cake bite with a dollop of whipped cream and a slice of fresh strawberry.",
      "Serve immediately or refrigerate until ready to serve."
    ]
  },
  {
    "title": "Homemade Mixed Berries Wedding Cake",
    "full_description": "This Homemade Mixed Berries Wedding Cake is a perfect dessert for weddings, featuring layers of light sponge cake and fresh mixed berries, topped with whipped cream.",
    "photo": "/Images/menus/menu122.jpg",
    "ingredients": {
      "sponge cake": [
        "1 1/2 cups all-purpose flour",
        "1 cup sugar",
        "1/2 cup butter",
        "2 eggs",
        "1/2 cup milk"
      ],
      "filling": [
        "1 cup fresh mixed berries",
        "1/4 cup sugar",
        "2 tbsp lemon juice"
      ],
      "frosting": [
        "2 cups whipped cream",
        "1/4 cup powdered sugar"
      ]
    },
    "instructions": [
      "Preheat your oven to 350°F (175°C).",
      "In a mixing bowl, cream together the butter and sugar.",
      "Add the eggs, one at a time, and mix until smooth. Stir in the milk.",
      "Gradually add the flour and mix until combined.",
      "Pour the batter into two greased 8-inch cake pans and bake for 25-30 minutes, or until a toothpick comes out clean.",
      "While the cakes are cooling, prepare the mixed berry filling by combining berries, sugar, and lemon juice in a saucepan over medium heat. Simmer for 5-7 minutes.",
      "Whip the cream with powdered sugar until stiff peaks form.",
      "Once the cakes are cool, spread a layer of whipped cream and berry filling between each layer.",
      "Frost the entire cake with whipped cream and decorate with fresh berries."
    ]
  },
  {
    "title": "M&M’s Chocolate Cake",
    "full_description": "This M&M’s Chocolate Cake is a fun twist on a classic chocolate cake, topped with colorful M&M’s candies, making it perfect for kids and adults alike.",
    "photo": "/Images/menus/menu138.jpg",
    "ingredients": {
      "cake": [
        "1 1/2 cups all-purpose flour",
        "1 cup cocoa powder",
        "1 cup sugar",
        "2 eggs",
        "1/2 cup milk",
        "1/2 cup butter"
      ],
      "topping": [
        "1 cup M&M’s"
      ]
    },
    "instructions": [
      "Preheat your oven to 350°F (175°C).",
      "In a large bowl, combine the flour, cocoa powder, and sugar.",
      "Add the eggs, milk, and butter, and mix until smooth.",
      "Pour the batter into a greased 9-inch round cake pan and bake for 25-30 minutes.",
      "Once baked, let the cake cool completely before decorating.",
      "Top the cooled cake with a generous amount of M&M’s candies.",
      "Serve and enjoy!"
    ]
  },
  {
    "title": "Almond Cinnamon Sponge Cake",
    "full_description": "This Almond Cinnamon Sponge Cake is a soft, fluffy dessert with a subtle almond and cinnamon flavor, perfect for an afternoon tea.",
    "photo": "/Images/menus/menu128.jpg",
    "ingredients": {
      "sponge cake": [
        "1 1/2 cups all-purpose flour",
        "1/2 cup sugar",
        "4 eggs",
        "1/2 tsp cinnamon",
        "1/2 tsp almond extract"
      ],
      "topping": [
        "1/4 cup sliced almonds"
      ]
    },
    "instructions": [
      "Preheat your oven to 350°F (175°C).",
      "In a bowl, beat the eggs and sugar until fluffy.",
      "Sift in the flour, cinnamon, and almond extract, and gently fold.",
      "Pour the batter into a greased 9-inch round cake pan and bake for 20-25 minutes.",
      "Once cooled, sprinkle with sliced almonds for decoration."
    ]
  },
  {
    "title": "Caramel Strawberry Milkshake",
    "full_description": "The Caramel Strawberry Milkshake is a delightful blend of rich, velvety flavors, perfect for satisfying your sweet tooth. This indulgent beverage combines the natural sweetness of fresh strawberries with the smooth, buttery taste of caramel, creating a harmonious balance that’s both refreshing and decadent.",
    "photo": "/Images/menus/menu20.jpg",
    "ingredients": {
      "milkshake": [
        "250g fresh strawberries",
        "3 tbsp caramel sauce",
        "2 cups vanilla ice cream",
        "1 cup milk",
        "Whipped cream for topping",
        "Extra caramel sauce for drizzling"
      ]
    },
    "instructions": [
      "Add strawberries, caramel sauce, vanilla ice cream, and milk to a blender.",
      "Blend until smooth and creamy.",
      "Pour into glasses and top with whipped cream.",
      "Drizzle extra caramel sauce on top and serve immediately."
    ]
  },
  {
    "title": "Cashew Vegan Rice",
    "full_description": "This Cashew Vegan Rice is a flavorful, plant-based dish that combines fragrant rice with crunchy cashews and a variety of fresh vegetables. It’s a simple yet nourishing meal, perfect as a main dish or a side.",
    "photo": "/Images/menus/menu21.jpg",
    "ingredients": {
      "Rice": [
        "2 cups basmati rice, rinsed and drained",
        "3 1/2 cups vegetable broth",
        "1 tbsp coconut oil",
        "1/2 cup cashews, toasted"
      ],
      "Vegetables and Seasoning": [
        "1 small onion, finely chopped",
        "1 bell pepper, diced",
        "1 carrot, grated",
        "1/2 cup peas, fresh or frozen",
        "2 cloves garlic, minced",
        "1 tbsp soy sauce",
        "Salt and pepper, to taste",
        "1/4 cup fresh cilantro, chopped (optional)"
      ]
    },
    "instructions": [
      "Heat the coconut oil in a large pot over medium heat. Add the onion and cook until translucent.",
      "Add the garlic, bell pepper, carrot, and peas. Sauté for 5-7 minutes until vegetables are tender.",
      "Stir in the rice and soy sauce, and cook for another 1-2 minutes, allowing the flavors to meld.",
      "Pour in the vegetable broth, season with salt and pepper, and bring to a boil. Reduce the heat to low, cover, and simmer for 15-20 minutes or until the rice is cooked and liquid is absorbed.",
      "Remove from heat, fluff the rice with a fork, and fold in the toasted cashews and cilantro, if desired.",
      "Serve warm as a main dish or side, and enjoy!"
    ]
  },
  {
    "title": "Smoked Salmon Salad Sandwich",
    "full_description": "This Smoked Salmon Salad Sandwich brings together the rich taste of smoked salmon with a refreshing mix of cucumber, red onion, and a creamy dill dressing. It's served on whole-grain bread, making it a healthy and delicious option.",
    "photo": "/Images/menus/menu22.jpg",
    "ingredients": {
      "Sandwich Filling": [
        "200g smoked salmon, chopped",
        "1/2 cucumber, thinly sliced",
        "1/4 red onion, finely diced",
        "1/4 cup Greek yogurt",
        "1 tbsp fresh dill, chopped",
        "1 tbsp lemon juice",
        "Salt and pepper, to taste"
      ],
      "Bread and Assembly": [
        "4 slices whole-grain or sourdough bread, toasted",
        "1/2 avocado, sliced (optional)",
        "Lettuce leaves"
      ]
    },
    "instructions": [
      "In a medium bowl, combine Greek yogurt, lemon juice, dill, salt, and pepper to make the dressing.",
      "Add the chopped smoked salmon, cucumber, and red onion to the dressing and gently mix until evenly combined.",
      "To assemble, place lettuce leaves on two slices of toasted bread. Spoon the smoked salmon salad mixture over the lettuce, then add avocado slices if desired.",
      "Top with the remaining bread slices to complete the sandwiches. Serve immediately and enjoy!"
    ]
  },
  {
    "title": "Salmon in Creamy Sun-Dried Tomato Sauce",
    "full_description": "This Salmon in Creamy Sun-Dried Tomato Sauce is an indulgent meal that pairs perfectly with pasta, rice, or vegetables. The creamy sauce is made with sun-dried tomatoes, garlic, and fresh basil, adding an irresistible depth of flavor.",
    "photo": "/Images/menus/menu5.jpg",
    "ingredients": {
      "Salmon": [
        "4 salmon fillets, skin-on or skinless",
        "Salt and pepper, to taste",
        "1 tbsp olive oil"
      ],
      "Creamy Sauce": [
        "1 tbsp olive oil",
        "3 cloves garlic, minced",
        "1/3 cup sun-dried tomatoes, chopped",
        "1 cup heavy cream",
        "1/4 cup grated Parmesan cheese",
        "1/2 cup fresh basil, chopped",
        "Salt and pepper, to taste"
      ]
    },
    "instructions": [
      "Season the salmon fillets with salt and pepper. Heat 1 tbsp olive oil in a large skillet over medium-high heat. Sear the salmon fillets for 3-4 minutes on each side or until cooked through. Remove from the skillet and set aside.",
      "In the same skillet, add another tablespoon of olive oil. Add the garlic and sun-dried tomatoes and sauté for 1-2 minutes until fragrant.",
      "Pour in the heavy cream, reduce the heat to low, and let it simmer for 3-5 minutes. Stir in the Parmesan cheese until melted and the sauce thickens.",
      "Add the basil and season with salt and pepper to taste.",
      "Return the salmon fillets to the skillet, spooning the sauce over them. Simmer for 1-2 minutes until warmed through.",
      "Serve the salmon with the creamy sauce over pasta, rice, or vegetables, and enjoy!"
    ]
  },
  {
    "title": "Healthy Jam Waffle Breakfast",
    "full_description": "This Healthy Jam Waffle Breakfast is a nutritious start to the day, featuring whole-grain waffles topped with naturally sweetened fruit jam and fresh berries. Perfect for a balanced and delicious morning meal.",
    "photo": "/Images/menus/menu6.jpg",
    "ingredients": {
      "Waffles": [
        "1 cup whole wheat flour",
        "1 tsp baking powder",
        "1/2 tsp cinnamon",
        "1 tbsp honey or maple syrup",
        "1 cup almond milk",
        "1 large egg",
        "1/4 cup applesauce"
      ],
      "Toppings": [
        "1/4 cup fruit jam (low sugar or homemade)",
        "Fresh berries (strawberries, blueberries, etc.)",
        "1 tbsp chia seeds (optional)"
      ]
    },
    "instructions": [
      "In a mixing bowl, combine flour, baking powder, and cinnamon.",
      "In another bowl, whisk together honey, almond milk, egg, and applesauce.",
      "Pour the wet ingredients into the dry ingredients and stir until just combined.",
      "Preheat a waffle maker, lightly oil it, and pour in the batter. Cook according to the waffle maker instructions.",
      "Top each waffle with fruit jam, fresh berries, and chia seeds. Serve warm."
    ]
  },
  {
    "title": "Chocolate and Banana Jar Cake",
    "full_description": "This Chocolate and Banana Jar Cake is a delightful treat featuring layers of rich chocolate cake, fresh banana slices, and whipped cream. Served in a jar, it’s easy to assemble and makes a visually appealing dessert.",
    "photo": "/Images/menus/menu6.jpg",
    "ingredients": {
      "Cake Layers": [
        "1 cup chocolate cake, crumbled",
        "2 ripe bananas, sliced"
      ],
      "Filling": [
        "1 cup whipped cream or Greek yogurt",
        "2 tbsp chocolate syrup",
        "1 tsp cocoa powder (optional)"
      ]
    },
    "instructions": [
      "In small jars, add a layer of crumbled chocolate cake.",
      "Top with a layer of banana slices, then a layer of whipped cream.",
      "Repeat layers until the jar is full. Drizzle chocolate syrup on top and sprinkle with cocoa powder if desired.",
      "Chill for 10-15 minutes before serving or enjoy immediately."
    ]
  },
  {
    "title": "Berry Madness Biscuits",
    "full_description": "Berry Madness Biscuits are soft, buttery biscuits loaded with mixed berries like strawberries, blueberries, and raspberries. Topped with a light glaze, these biscuits are perfect for breakfast or as a sweet snack anytime.",
    "photo": "/Images/menus/menu7.jpg",
    "ingredients": {
      "Biscuits": [
        "2 cups all-purpose flour",
        "2 tsp baking powder",
        "1/2 tsp salt",
        "1/4 cup cold butter, cubed",
        "1/2 cup milk",
        "1 egg",
        "1/2 cup mixed berries (strawberries, blueberries, raspberries)"
      ],
      "Glaze": [
        "1/2 cup powdered sugar",
        "2 tbsp milk",
        "1/4 tsp vanilla extract"
      ]
    },
    "instructions": [
      "Preheat the oven to 425°F (220°C). Line a baking sheet with parchment paper.",
      "In a large mixing bowl, whisk together the flour, baking powder, and salt.",
      "Add the cold butter to the flour mixture and use a pastry cutter or your fingers to cut it into the flour until it resembles coarse crumbs.",
      "Stir in the milk and egg, mixing until just combined. Be careful not to overwork the dough.",
      "Gently fold in the mixed berries, being careful not to crush them.",
      "Turn the dough onto a floured surface and pat it into a 1-inch thick rectangle. Cut into rounds using a biscuit cutter or a glass.",
      "Place the biscuits on the prepared baking sheet, making sure they are close together for soft edges.",
      "Bake for 12-15 minutes or until golden brown on top.",
      "While the biscuits are baking, prepare the glaze by whisking together the powdered sugar, milk, and vanilla extract until smooth.",
      "Once the biscuits are done, remove them from the oven and let them cool slightly.",
      "Drizzle the glaze over the warm biscuits and serve."
    ]
  },
  {
    "title": "Caramel Blueberry Scones",
    "full_description": "These Caramel Blueberry Scones are tender, flaky, and full of juicy blueberries. Drizzled with caramel sauce, they’re an indulgent treat for any time of day.",
    "photo": "/Images/menus/menu26.jpg",
    "ingredients": {
      "Scones": [
        "2 cups all-purpose flour",
        "1/4 cup sugar",
        "1 tbsp baking powder",
        "1/2 cup cold butter, cubed",
        "3/4 cup heavy cream",
        "1 cup fresh blueberries"
      ],
      "Topping": [
        "Caramel sauce for drizzling"
      ]
    },
    "instructions": [
      "Preheat the oven to 400°F (200°C) and line a baking sheet with parchment paper.",
      "In a large bowl, mix flour, sugar, and baking powder.",
      "Cut in the cold butter until the mixture resembles coarse crumbs. Stir in heavy cream until just combined.",
      "Gently fold in the blueberries, then turn the dough onto a floured surface and shape into a disc.",
      "Cut into wedges and place on the baking sheet. Bake for 15-18 minutes or until golden brown.",
      "Drizzle with caramel sauce before serving."
    ]
  },
  {
    "title": "Blueberry Carrot Cake",
    "full_description": "This Blueberry Carrot Cake combines the natural sweetness of carrots with the tartness of blueberries, resulting in a deliciously moist and flavorful cake.",
    "photo": "/Images/menus/menu9.jpg",
    "ingredients": {
      "Cake": [
        "1 1/2 cups all-purpose flour",
        "1 tsp baking soda",
        "1 tsp cinnamon",
        "1/2 tsp nutmeg",
        "1/2 cup sugar",
        "1/2 cup vegetable oil",
        "2 large eggs",
        "1 cup grated carrots",
        "1 cup fresh blueberries"
      ]
    },
    "instructions": [
      "Preheat the oven to 350°F (175°C) and grease a 9-inch cake pan.",
      "In a bowl, combine flour, baking soda, cinnamon, and nutmeg.",
      "In a separate bowl, mix sugar, oil, and eggs. Add grated carrots and stir to combine.",
      "Fold the dry ingredients into the wet ingredients, then gently fold in the blueberries.",
      "Pour into the prepared pan and bake for 25-30 minutes or until a toothpick comes out clean."
    ]
  },
  {
    "title": "Vegan Cauliflower Salad",
    "full_description": "This Vegan Cauliflower Salad is a colorful, nutrient-packed dish with roasted cauliflower, crisp veggies, and a zesty vinaigrette. It’s a fantastic choice for a wholesome meal or side.",
    "photo": "/Images/menus/menu10.jpg",
    "ingredients": {
      "Salad": [
        "1 head cauliflower, chopped",
        "1 tbsp olive oil",
        "Salt and pepper, to taste",
        "1 cup cherry tomatoes, halved",
        "1 cucumber, diced",
        "1/4 cup red onion, thinly sliced",
        "1/4 cup fresh parsley, chopped"
      ],
      "Dressing": [
        "3 tbsp olive oil",
        "2 tbsp lemon juice",
        "1 tsp Dijon mustard",
        "Salt and pepper, to taste"
      ]
    },
    "instructions": [
      "Preheat the oven to 400°F (200°C). Toss cauliflower with olive oil, salt, and pepper. Spread on a baking sheet and roast for 20-25 minutes until tender.",
      "In a large bowl, combine cherry tomatoes, cucumber, red onion, and parsley.",
      "Add the roasted cauliflower to the bowl. Whisk together the dressing ingredients and pour over the salad. Toss to combine."
    ]
  },
  {
    "title": "Roasted Red Pepper Soup",
    "full_description": "This Roasted Red Pepper Soup is a creamy, flavorful blend of roasted red peppers, garlic, and herbs. Perfect for a comforting lunch or dinner, served with crusty bread.",
    "photo": "/Images/menus/menu11.jpg",
    "ingredients": {
      "Soup": [
        "4 red bell peppers, halved and deseeded",
        "1 tbsp olive oil",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "4 cups vegetable broth",
        "Salt and pepper, to taste",
        "1/4 cup fresh basil leaves, chopped"
      ]
    },
    "instructions": [
      "Preheat the oven to 425°F (220°C). Place the red bell peppers on a baking sheet and roast for 20-25 minutes until charred.",
      "In a large pot, heat olive oil and sauté the onion and garlic until softened.",
      "Add the roasted peppers, vegetable broth, salt, and pepper. Simmer for 10 minutes.",
      "Blend the soup until smooth. Stir in the basil and serve warm."
    ]
  },
  {
    "title": "Eggs and Avocado Toast",
    "full_description": "This Eggs and Avocado Toast is a simple yet satisfying meal with creamy avocado spread and either fried or poached eggs on whole-grain toast. It’s a great way to enjoy a healthy breakfast or brunch.",
    "photo": "/Images/menus/menu12.jpg",
    "ingredients": {
      "Toast": [
        "2 slices whole-grain bread, toasted",
        "1 ripe avocado, mashed",
        "2 large eggs (poached or fried)",
        "Salt, pepper, and red pepper flakes, to taste"
      ]
    },
    "instructions": [
      "Spread mashed avocado on each slice of toasted bread.",
      "Top each slice with a poached or fried egg.",
      "Season with salt, pepper, and red pepper flakes to taste. Serve immediately."
    ]
  },
  {
    "title": "Pork Shoulder Cashew Noodles",
    "full_description": "This Pork Shoulder Cashew Noodles dish combines tender pork with roasted cashews and vegetables in a flavorful noodle stir-fry. Perfect for a satisfying dinner with a touch of crunch.",
    "photo": "/Images/menus/menu13.jpg",
    "ingredients": {
      "Noodles": [
        "300g pork shoulder, sliced",
        "2 cups cooked noodles",
        "1/2 cup cashews, toasted",
        "1 bell pepper, sliced",
        "1 carrot, julienned",
        "2 tbsp soy sauce",
        "1 tbsp sesame oil",
        "2 green onions, chopped"
      ]
    },
    "instructions": [
      "Heat sesame oil in a skillet over medium-high heat. Add pork slices and cook until browned.",
      "Add bell pepper, carrot, and soy sauce, and cook until vegetables are tender.",
      "Add the cooked noodles, cashews, and green onions. Toss to combine and serve warm."
    ]
  },
  {
    "title": "Toasted Farfalle in Pesto Sauce",
    "full_description": "This Toasted Farfalle in Pesto Sauce is a simple yet flavorful pasta dish. Toasted farfalle adds a nutty taste that pairs beautifully with homemade basil pesto, making it a quick and delicious meal.",
    "photo": "/Images/menus/menu14.jpg",
    "ingredients": {
      "Pasta": [
        "200g farfalle pasta",
        "2 tbsp olive oil",
        "1/2 cup basil pesto",
        "Salt and pepper, to taste",
        "Grated Parmesan cheese for garnish"
      ]
    },
    "instructions": [
      "In a large skillet, heat olive oil over medium heat. Add farfalle and toast until golden brown.",
      "Cook the toasted pasta in boiling water according to package instructions, then drain.",
      "Toss the pasta with basil pesto, salt, and pepper. Serve with grated Parmesan cheese on top."
    ]
  },
  {
    "title": "Cheesy Bacon Burger Sliders",
    "full_description": "These Cheesy Bacon Burger Sliders are loaded with flavor, featuring tender beef patties, gooey cheese, and crispy bacon on soft slider buns. They're ideal for gatherings and make for a delicious appetizer or main course.",
    "photo": "/Images/menus/menu15.jpg",
    "ingredients": {
      "Sliders": [
        "500g ground beef",
        "Salt and pepper, to taste",
        "6 slices of cheddar cheese",
        "6 slider buns",
        "6 slices of bacon, cooked and cut in half",
        "Lettuce, tomato, and pickles for garnish"
      ]
    },
    "instructions": [
      "Season the ground beef with salt and pepper, then shape into small patties.",
      "Cook the patties in a skillet over medium-high heat for 3-4 minutes per side, or until desired doneness.",
      "Add a slice of cheddar cheese to each patty and allow it to melt.",
      "Assemble the sliders by placing lettuce, a patty, bacon, tomato, and pickles on each slider bun.",
      "Serve warm and enjoy!"
    ]
  },
  {
    "title": "Fig and Raisins Oatmeal",
    "full_description": "This Fig and Raisins Oatmeal is a comforting bowl of oats with a hint of sweetness from dried figs and raisins. It’s an excellent source of fiber and nutrients to start your day off right.",
    "photo": "/Images/menus/menu16.jpg",
    "ingredients": {
      "Oatmeal": [
        "1 cup rolled oats",
        "2 cups milk or water",
        "1/4 cup dried figs, chopped",
        "1/4 cup raisins",
        "1 tbsp honey or maple syrup (optional)",
        "A pinch of cinnamon"
      ]
    },
    "instructions": [
      "In a medium saucepan, bring milk or water to a simmer. Add oats and cook for 5-7 minutes, stirring occasionally.",
      "Add chopped figs, raisins, and cinnamon. Cook for an additional 2-3 minutes until the oats are creamy.",
      "Sweeten with honey or maple syrup if desired. Serve warm and garnish with extra figs or raisins if you like."
    ]
  },
  {
    "title": "Silky Smooth PannaCotta",
    "full_description": "This Silky Smooth Panna Cotta is an elegant dessert made with cream, sugar, and vanilla. It's perfect for dinner parties and can be customized with fruit toppings or sauces.",
    "photo": "/Images/menus/menu17.jpg",
    "ingredients": {
      "Panna Cotta": [
        "1 cup heavy cream",
        "1 cup milk",
        "1/4 cup sugar",
        "1 tsp vanilla extract",
        "1 tbsp powdered gelatin",
        "3 tbsp water"
      ]
    },
    "instructions": [
      "In a small bowl, sprinkle gelatin over water and let it bloom for 5 minutes.",
      "In a saucepan, heat the cream, milk, and sugar over medium heat until the sugar dissolves (do not let it boil).",
      "Remove from heat, add the gelatin mixture and vanilla extract, stirring until the gelatin is completely dissolved.",
      "Pour the mixture into serving cups and refrigerate for at least 4 hours or until set.",
      "Serve with fresh fruit or a fruit sauce on top."
    ]
  },
  {
    "title": "Triple Decker Cranberry Cake",
    "full_description": "This Triple Decker Cranberry Cake is a show-stopping dessert with layers of moist cake, tangy cranberry filling, and smooth frosting. It’s perfect for holiday celebrations or special occasions.",
    "photo": "/Images/menus/menu18.jpg",
    "ingredients": {
      "Cake": [
        "3 cups all-purpose flour",
        "1 tbsp baking powder",
        "1/2 tsp salt",
        "1 cup sugar",
        "1 cup butter, softened",
        "4 eggs",
        "1 tsp vanilla extract",
        "1 cup milk"
      ],
      "Filling and Frosting": [
        "1 1/2 cups fresh cranberries",
        "1/2 cup sugar",
        "1/2 cup water",
        "2 cups whipped cream or frosting of choice"
      ]
    },
    "instructions": [
      "Preheat oven to 350°F (175°C). Grease and flour three 8-inch cake pans.",
      "In a bowl, whisk together flour, baking powder, and salt.",
      "In a large mixing bowl, cream together butter and sugar until light and fluffy. Add eggs one at a time, then vanilla.",
      "Add dry ingredients alternately with milk, mixing just until combined. Divide batter evenly among the cake pans.",
      "Bake for 25-30 minutes, or until a toothpick inserted in the center comes out clean. Let cool.",
      "To make the cranberry filling, combine cranberries, sugar, and water in a saucepan. Simmer until cranberries burst and the mixture thickens. Let cool.",
      "Layer the cake with cranberry filling and top with whipped cream or frosting. Decorate as desired."
    ]
  },
  {
    "title": "Very Berry Healthy Summer Smoothie",
    "full_description": "This Very Berry Healthy Summer Smoothie is a cooling blend of strawberries, blueberries, raspberries, and blackberries. It’s naturally sweetened with honey and provides a burst of antioxidants for a refreshing and nourishing treat.",
    "photo": "/Images/menus/menu19.jpg",
    "ingredients": {
      "Smoothie": [
        "1/2 cup strawberries",
        "1/2 cup blueberries",
        "1/2 cup raspberries",
        "1/2 cup blackberries",
        "1 cup almond milk or water",
        "1 tbsp honey (optional)",
        "1/2 cup ice cubes"
      ]
    },
    "instructions": [
      "Place all ingredients in a blender and blend until smooth.",
      "Adjust sweetness with honey if desired, then blend again.",
      "Pour into a glass and serve immediately for a refreshing treat."
    ]
  },
  {
    "title": "Crispy Orange Chips",
    "full_description": "These Crispy Orange Chips are a naturally sweet, healthy snack that can be enjoyed on their own or added to desserts for a burst of citrus flavor. They're easy to make and perfect for citrus lovers!",
    "photo": "/Images/menus/menu20.jpg",
    "ingredients": {
      "Orange Chips": [
        "2 large oranges",
        "1 tbsp honey or sugar (optional)"
      ]
    },
    "instructions": [
      "Preheat the oven to 200°F (90°C). Line a baking sheet with parchment paper.",
      "Thinly slice the oranges, about 1/8 inch thick. Arrange slices on the baking sheet in a single layer.",
      "Optionally, drizzle a small amount of honey or sprinkle sugar over the slices.",
      "Bake for 2-3 hours, flipping halfway through, until slices are dry and crisp.",
      "Let cool before serving or storing in an airtight container."
    ]
  },
  {
    "title": "Turmeric Lavender Tea",
    "full_description": "This Turmeric Lavender Tea is both anti-inflammatory and calming, combining earthy turmeric with floral lavender. It’s a cozy and relaxing drink perfect for winding down.",
    "photo": "/Images/menus/menu21.jpg",
    "ingredients": {
      "Tea": [
        "1 cup water",
        "1/2 tsp ground turmeric",
        "1/2 tsp dried lavender buds",
        "1 tsp honey (optional)"
      ]
    },
    "instructions": [
      "In a small saucepan, bring water to a boil.",
      "Add turmeric and lavender, reduce heat, and let simmer for 5 minutes.",
      "Strain into a cup and sweeten with honey if desired. Enjoy warm."
    ]
  },
  {
    "title": "Blue Velvet Brownies",
    "full_description": "These Blue Velvet Brownies are a unique and fun twist on traditional brownies. They’re rich, moist, and a visual delight with their striking blue hue.",
    "photo": "/Images/menus/menu22.jpg",
    "ingredients": {
      "Brownies": [
        "1/2 cup butter, melted",
        "1 cup sugar",
        "2 large eggs",
        "1 tsp vanilla extract",
        "1/2 cup all-purpose flour",
        "1/4 cup cocoa powder",
        "5-6 drops blue food coloring"
      ]
    },
    "instructions": [
      "Preheat the oven to 350°F (175°C) and grease an 8x8 inch baking dish.",
      "In a mixing bowl, combine melted butter and sugar. Mix in eggs and vanilla extract.",
      "Sift in the flour and cocoa powder, stirring until combined.",
      "Add blue food coloring and mix until the batter is evenly colored.",
      "Pour into the baking dish and bake for 20-25 minutes, or until a toothpick comes out clean. Let cool before cutting."
    ]
  },
  {
    "title": "Birthday Cupcakes",
    "full_description": "These Birthday Cupcakes are light, fluffy, and topped with a swirl of creamy buttercream frosting. Decorated with sprinkles, they're the perfect treat for birthdays or special occasions.",
    "photo": "/Images/menus/menu23.jpg",
    "ingredients": {
      "Cupcakes": [
        "1 cup all-purpose flour",
        "1/2 cup sugar",
        "1/4 cup butter, softened",
        "2 large eggs",
        "1/2 cup milk",
        "1 tsp vanilla extract",
        "1 tsp baking powder",
        "A pinch of salt",
        "Sprinkles for decoration"
      ],
      "Frosting": [
        "1/2 cup butter, softened",
        "2 cups powdered sugar",
        "2-3 tbsp milk",
        "1 tsp vanilla extract"
      ]
    },
    "instructions": [
      "Preheat oven to 350°F (175°C) and line a muffin tin with cupcake liners.",
      "In a large bowl, cream butter and sugar until light and fluffy. Add eggs one at a time, mixing well.",
      "Add vanilla, then alternate adding flour and milk, mixing until just combined.",
      "Fill cupcake liners 3/4 full and bake for 15-18 minutes. Let cool completely.",
      "To make the frosting, beat butter until smooth. Gradually add powdered sugar, then milk and vanilla, and beat until fluffy.",
      "Frost the cooled cupcakes and top with sprinkles."
    ]
  },
  {
    "title": "Gourmet Fillet in Roasted Almond Sauce",
    "full_description": "This Gourmet Fillet in Roasted Almond Sauce is a luxurious dish, featuring a tender cut of meat complemented by a creamy sauce made with roasted almonds. Perfect for special occasions.",
    "photo": "/Images/menus/menu24.jpg",
    "ingredients": {
      "Fillet": [
        "2 fillets (beef or chicken)",
        "Salt and pepper, to taste",
        "1 tbsp olive oil"
      ],
      "Sauce": [
        "1/2 cup roasted almonds, chopped",
        "1/2 cup heavy cream",
        "1 tbsp butter",
        "1/2 tsp garlic powder"
      ]
    },
    "instructions": [
      "Season the fillets with salt and pepper. In a skillet, heat olive oil over medium-high heat and cook the fillets to your preferred doneness.",
      "In a saucepan, melt butter and add roasted almonds and garlic powder.",
      "Pour in the heavy cream, stirring until the sauce thickens. Serve the fillets with the sauce drizzled on top."
    ]
  },
  {
    "title": "Four-Ingredient Oatmeal Pancakes",
    "full_description": "These Four-Ingredient Oatmeal Pancakes are simple, healthy, and packed with fiber. They’re naturally sweet and can be topped with your favorite fruits or syrup.",
    "photo": "/Images/menus/menu25.jpg",
    "ingredients": {
      "Pancakes": [
        "1 cup rolled oats",
        "1 cup milk",
        "1 ripe banana",
        "1/2 tsp baking powder"
      ]
    },
    "instructions": [
      "In a blender, combine oats, milk, banana, and baking powder. Blend until smooth.",
      "Heat a non-stick skillet over medium heat and pour 1/4 cup batter per pancake.",
      "Cook each side for 2-3 minutes, until golden brown. Serve with your favorite toppings."
    ]
  },
  {
    "title": "Mighty Cheesy Breakfast Burger",
    "full_description": "This Mighty Cheese Breakfast Burger is a savory breakfast option that combines a juicy beef patty with crispy bacon, a fried egg, and plenty of melted cheese. Sandwiched between toasted English muffins, it’s a delicious way to kick-start the day!",
    "photo": "/Images/menus/menu4.jpg",
    "ingredients": {
      "Burger": [
        "4 English muffins, split and toasted",
        "4 beef patties (around 100g each)",
        "4 slices of cheddar cheese",
        "4 large eggs",
        "8 slices of bacon",
        "Salt and pepper, to taste"
      ],
      "Optional Toppings": [
        "1/2 avocado, sliced",
        "Lettuce leaves",
        "Tomato slices",
        "Hot sauce or ketchup, to taste"
      ]
    },
    "instructions": [
      "Cook the bacon in a skillet over medium heat until crispy. Remove and set aside on a paper towel to drain excess grease.",
      "In the same skillet, cook the beef patties on medium heat until they reach desired doneness, seasoning with salt and pepper. Add a slice of cheese on top of each patty just before they’re done to allow it to melt.",
      "While the patties are cooking, fry the eggs to your preferred level of doneness. For a classic breakfast burger, leave the yolk runny.",
      "Assemble the burgers: Place the bottom half of an English muffin on each plate. Top with a cheese-covered beef patty, then add bacon slices, a fried egg, and any optional toppings you like.",
      "Finish with the top half of the English muffin and serve immediately with ketchup or hot sauce on the side."
    ]
  }
]